// Задача №1
/*Оголоси змінну message і запиши в неї повідомлення про покупку,
рядок у форматі: "You picked <назва товару>, price per item is <ціна товару> credits".
Де < назва товару > і < ціна товару > — це значення змінних productName і pricePerItem.
Використовуй синтаксис шаблонних рядків.
*/
const productName = "Droid";
const pricePerItem = 3500;

// ..................................................

// Задача №2
// Магазин з продажу ремонтних дроїдів готовий до відкриття,
// залишилося написати скрипт для їх замовлення.
// Оголоси змінні та присвой їм відповідні значення:

// pricePerDroid - ціна одного дроїда, значення 800
// orderedQuantity - кількість дроїдів у замовленні, значення 6
// deliveryFee - вартість доставки, значення 50
// totalPrice - загальна сума замовлення до сплати, не забудь про вартість доставки
// message - повідомлення про стан замовлення у форматі
// "You ordered droids worth <total price> credits. Delivery (<delivery fee> credits) is included in total price."

// ....................................................

// Задача №3
// Заміни вирази зі стандартними математичними операторами
// на комбінований оператор присвоєння
// з додаванням, відніманням, множенням і діленням.

// Значення змінної a дорівнює 7
// Використаний оператор +=

// Значення змінної b дорівнює 6
// Використаний оператор -=

// Значення змінної c дорівнює 45
// Використаний оператор *=

// Значення змінної d дорівнює 2
// Використаний оператор /=

let a = 5;
let b = 10;
let c = 15;
let d = 20;